from math import pi
print("%.1f" %pi)

ส่วนสูง= (float(input("กรุณากรอกส่วนสูงของคุณ cm.:")))
น้ำหนัก=(float(input("กรุณากกรอกน้ำหนักของคุณ kg.:")))
bmi=(int(น้ำหนัก/(ส่วนสูง/100)**2))
print("ค่าbmiของคุณคือ:",bmi)
if bmi<18.5:
    print("คุณอยู่ในเกณฑ์ น้ำหนักน้อย อย่าลืมทานอาการให้ครบ5หมู่และพักผ่อนให้เพียงพอด้วยหล่ะ><")
elif bmi>=18.5 and bmi<25:
    print("คุณอยู่ในเกณฑ์ น้ำหนักปกติ ดีมากเลยค่ะและอย่าลืมดูแลสุขภาพตัวเองด้วยนะคะ><")
else:
    print("คุณอยู่ในเกณฑ์ น้ำหนักมากเกินไป อย่าลืมทานอาหารให้ครบ 5หมู่และออกกำลังกายอย่างสม่ำเสมอนะคะ><")
    


